In [40]:
import numpy as np
import pandas as pd
# Data Inspection: head(), tail(), describe(), index, values, rename().
# Data Manipulation: drop(), replace(), astype().
# Statistics and Analysis: mean(), median(), sum(), min(), max(), std(), corr(), cov().
# Transformation and Mapping: apply(), map().
# Handling Missing Data: isna(), notna(), isnull(), notnull(), fillna(), dropna().

In [2]:
df= pd.DataFrame({"name" :["harsh", "varun"], "age" :[19,22]})

In [3]:
df

    name  age
0  harsh   19
1  varun   22

In [29]:
d=[["harsh" , 19] , ["varun" , 22]]
df2= pd.DataFrame(d , columns=["name" , "age"],index=["x","y"])

In [30]:
df2

    name  age
x  harsh   19
y  varun   22

In [4]:
data =[10 ,20,30,40]
s= pd.Series(data)

In [5]:
s

0    10
1    20
2    30
3    40
dtype: int64

In [6]:
data = ['apple', 'banana', 'cherry', 'date']
labels = ['fruit_a', 'fruit_b', 'fruit_c', 'fruit_d']

my_series = pd.Series(data, index=labels)

In [7]:
my_series

fruit_a     apple
fruit_b    banana
fruit_c    cherry
fruit_d      date
dtype: object

In [8]:
data_dict = {'day1': 420, 'day2': 380, 'day3': 390}

my_series = pd.Series(data_dict)

print(my_series)

day1    420
day2    380
day3    390
dtype: int64

In [9]:
my_series = pd.Series(['red', 'green', 'blue', 'yellow'], index=['color1', 'color2', 'color3', 'color4'])

# Access by position (integer index)
print("Element at position 1:", my_series[1])

Element at position 1: green

In [10]:
my_series

color1       red
color2     green
color3      blue
color4    yellow
dtype: object

In [11]:
s1 = pd.Series([1, 2, 3])
s2 = pd.Series([4, 5, 6])

result = s1 + s2
print(result)

0    5
1    7
2    9
dtype: int64

In [12]:
f= pd.DataFrame({"name" :["harsh", "varun"], "age" :[19,22]})

In [13]:
d= pd.DataFrame({"name" : ["kenal"] , "age" : [23]})

In [14]:
s=d+f

In [15]:
s

         name   age
0  kenalharsh  42.0
1         NaN   NaN

In [25]:
import pandas as pd

df1 = pd.DataFrame({'A': [0,1,2], 'B': [4, 5, 6]})
df2 = pd.DataFrame({'c': [10, 11, 12], 'A': [13, 14, 15]})

result = df2+df1
print(result)

    A   B   c
0  13 NaN NaN
1  15 NaN NaN
2  17 NaN NaN

In [37]:
import pandas as pd

s1 = pd.Series([1, 2, 3], index=['a', 'b', 'c'])
s2 = pd.Series([4, 5, 6], index=['b', 'c', 'd'])

result = s1+ s2
print(result)

a    NaN
b    6.0
c    8.0
d    NaN
dtype: float64

In [54]:
data = { 'B': [5, 7,9], 'C': [9, 10, np.nan]}
df = pd.DataFrame(data)

# Using loc to select rows where column 'B' has a missing value
missing_b_rows_loc = df.loc[df['C'].isna()]
missing_b_rows_loc

   B   C
2  9 NaN

In [60]:
df.loc[2,'C']=7

In [61]:
df

   B     C
0  5   9.0
1  7  10.0
2  9   7.0

In [62]:
df.loc[1,'C']=4

In [63]:
df

   B    C
0  5  9.0
1  7  4.0
2  9  7.0

In [65]:
df.iloc[1,1]=798

In [66]:
df

   B      C
0  5    9.0
1  7  798.0
2  9    7.0

In [67]:
data = { 'B': [5, 7,9], 'C': [9, 10, np.nan]}
df2=pd.DataFrame(data)

In [68]:
df2

   B     C
0  5   9.0
1  7  10.0
2  9   NaN

In [74]:
df2.dropna(axis=0)

   B     C
0  5   9.0
1  7  10.0

In [77]:
df2.fillna(method ='ffill')

   B     C
0  5   9.0
1  7  10.0
2  9  10.0

In [138]:
data = { 'B': [5, 7,9], 'C': [9, 10, np.nan]}

In [139]:
df3=pd.DataFrame(data)

In [140]:
df3

   B     C
0  5   9.0
1  7  10.0
2  9   NaN

In [142]:
df3.where(pd.notna(df3),df3.mean(),axis=1)

   B     C
0  5   9.0
1  7  10.0
2  9   9.5

In [91]:
# Create a DataFrame with some missing values
data = {'A': [1, 2, np.nan, 4, 5],
        'B': [np.nan, 10, 20, np.nan, 40]}
df = pd.DataFrame(data)

In [92]:
df

     A     B
0  1.0   NaN
1  2.0  10.0
2  NaN  20.0
3  4.0   NaN
4  5.0  40.0

In [93]:
df.interpolate()

     A     B
0  1.0   NaN
1  2.0  10.0
2  3.0  20.0
3  4.0  30.0
4  5.0  40.0

In [101]:
df.loc[0,'B']=5
df.interpolate()

     A     B
0  1.0   5.0
1  2.0  10.0
2  3.0  20.0
3  4.0  30.0
4  5.0  40.0

In [110]:
data = { 'B': [5, 7,9], 'C': [9, 10, np.nan]}

In [111]:
df3=pd.DataFrame(data)

In [112]:
df3

   B     C
0  5   9.0
1  7  10.0
2  9   NaN

In [127]:
df3.loc[df3['C'].isna()] =7

In [128]:
df3

   B     C
0  5   9.0
1  7  10.0
2  7   7.0

In [136]:
c=df3.where(df3['B']>5 , 6)

In [134]:
c

   B     C
0  6   6.0
1  7  10.0
2  7   7.0